rojarsmith/edt-hmi-studio/firmware/stm32h747i-disco/src/hmi_video.c
/*
 * Playing a video, and saying so when it cannot.
 *
 * The parts underneath this file each do one thing: hmi_sd.c mounts the card,
 * hmi_avi.c walks the file and hands back one compressed frame at a time, and
 * hmi_jpeg.c turns that frame into pixels using the JPEG codec and DMA2D. This
 * file is what makes them a widget: when to open the file, when to decode the
 * next frame, what to put on the screen while none of that has worked.
 *
 * Three decisions shape everything here.
 *
 * One player at a time. There is one JPEG codec and one frame buffer, and a
 * screen showing two videos at once is not a thing this hardware can do — so
 * the runtime plays the first video on the loaded screen and leaves any other
 * showing its message. Registering several is still useful and ordinary: one
 * per screen is the shape a project actually takes.
 *
 * Opened late, not at init. `hmi_video_attach` records the name and returns.
 * The card is touched the first time the widget is on the active screen, which
 * means a screen the user never opens costs nothing, a card pushed in after
 * boot is still found, and ui_init never blocks on a card that is not there.
 *
 * Decoded in the timer, synchronously. The whole runtime is one main loop; a
 * frame is read, decoded and shown inside one lv_timer callback, and the loop
 * carries on. That costs a few milliseconds against a 41 ms frame period at
 * 24 fps — see docs/video-playback.md §4 — and buys a module with no
 * concurrency in it at all.
 *
 * Shown on the display controller's second layer, not drawn by LVGL. A frame
 * handed to LVGL as an image is blitted into its frame buffer by the CPU and
 * then copied again to keep the second buffer in step — three megabytes of
 * SDRAM traffic a frame, which is most of the frame period on its own. The
 * LTDC composites its second layer over the first in hardware, so the frame
 * DMA2D wrote is the frame the panel scans, and nothing copies it. The cost
 * is that the layer is always on top: nothing LVGL draws can appear over a
 * playing video. See board_display.h.
 */

#include "hmi_video.h"

#include "board_display.h"
#include "hmi_avi.h"
#include "stm32h7xx_hal.h"
#include "hmi_jpeg.h"
#include "hmi_sd.h"

#include <string.h>

/**
 * How many Video widgets a project can carry.
 *
 * Not a limit on video, which is one at a time whatever this says — a limit on
 * how many widgets may be registered across every screen. Four is past what
 * any screen design has needed and costs a handful of bytes each.
 */
#define HMI_VIDEO_MAX_WIDGETS 4U

/** The longest file name the widget will hold, including the terminator. */
#define HMI_VIDEO_MAX_NAME 64U

/*
 * The largest picture this build decodes: the panel's own size. A frame bigger
 * than the screen has nowhere to go, and the buffers below are sized from
 * these two numbers.
 */
#define HMI_VIDEO_MAX_WIDTH 800U
#define HMI_VIDEO_MAX_HEIGHT 480U

/**
 * The biggest compressed frame the reader will accept.
 *
 * At the bit rate this is built for — around 27 Mbit/s, which is what a
 * high-quality 800x480 Motion JPEG runs at — a frame is roughly 140 KB. Half a
 * megabyte leaves room for a quality setting well past that before a file
 * stops playing, and a file that does exceed it says so rather than being
 * decoded from a truncated buffer.
 */
#define HMI_VIDEO_MAX_FRAME_BYTES (512U * 1024U)

/** Buffers of this size belong in the board's SDRAM, never in internal RAM. */
#define HMI_VIDEO_SDRAM __attribute__((section(".sdram"), aligned(32)))

/**
 * How often the runtime looks for something to do when nothing is playing.
 *
 * Slow on purpose. This is the tick that notices a screen with a video on it
 * has been loaded, and a fifth of a second is imperceptible against a screen
 * transition while costing nothing on a panel with no video in sight.
 */
#define HMI_VIDEO_IDLE_PERIOD_MS 200U

/**
 * How long a widget waits before trying the card again after a card-class
 * failure — no card, a card that would not mount, a read that failed.
 *
 * These are the failures that fix themselves: a card pushed in, a card that
 * answers on the second attempt, a CRC error on one read. Retrying them is
 * what makes "push the card in and it starts" true, and what keeps one bad
 * read from ending playback for good. A file-class failure — no such file, a
 * codec that is not Motion JPEG — is not retried, because nothing on the panel
 * is going to change it; leaving the screen and coming back does.
 */
#define HMI_VIDEO_RETRY_PERIOD_MS 1000U

/** What the panel says, in the panel's words. */
#define HMI_VIDEO_MSG_NOT_FOUND "Video not found"
#define HMI_VIDEO_MSG_NO_CARD "No SD card"
#define HMI_VIDEO_MSG_CARD_UNREADABLE "SD card unreadable"
#define HMI_VIDEO_MSG_FORMAT "Video format not supported"
#define HMI_VIDEO_MSG_BUSY "Another video is playing"
/* Nothing at all: the black frame with no words on it. */
#define HMI_VIDEO_MSG_BLANK ""

/** The message plus its detail line, as drawn. */
#define HMI_VIDEO_TEXT_MAX 112U

typedef enum {
    /** Registered, never opened. The state every widget starts in. */
    VIDEO_IDLE = 0,
    VIDEO_PLAYING,
    VIDEO_PAUSED,
    /** Ran to the end of a file that does not loop. Last frame stays up. */
    VIDEO_ENDED,
    /** Could not be played. The message on its face says why. */
    VIDEO_FAILED,
} video_state_t;

typedef struct {
    lv_obj_t *frame;
    /** Carries the message. Hidden while a picture is showing. */
    lv_obj_t *message;
    /** The screen the frame was created on, whose unload hides the overlay. */
    lv_obj_t *screen;

    char file_name[HMI_VIDEO_MAX_NAME];
    bool auto_play;
    bool loop;

    video_state_t state;
    /** Whether this widget is the one holding the open file and the buffers. */
    bool holds_session;
    /**
     * What the label currently says, so the timer does not re-set the same
     * text on every tick — lv_label_set_text reallocates and invalidates
     * whether or not the words changed.
     */
    char shown[HMI_VIDEO_TEXT_MAX];
    /**
     * When a card-class failure may be tried again, as an lv_tick_get value.
     * Zero when nothing is waiting. See HMI_VIDEO_RETRY_PERIOD_MS.
     */
    uint32_t retry_at;
} video_widget_t;

