rojarsmith/edt-hmi-studio/firmware/stm32h747i-disco/src/hmi_video.c
static video_widget_t widgets[HMI_VIDEO_MAX_WIDGETS];
static uint32_t widget_count;

/** The one open file, and the one player it belongs to. */
static hmi_avi_t session;
static video_widget_t *session_owner;

static lv_timer_t *video_timer;

/*
 * The big buffers, all in external SDRAM. Shared rather than per-widget,
 * because only one widget can be decoding at a time — see the file comment.
 *
 * Two picture buffers, because the LTDC is scanning one of them while DMA2D
 * writes the next. Decoding into the one on screen would tear: the top of the
 * panel would show the new frame and the bottom the old, on every frame. The
 * swap is staged and lands at vertical blanking.
 */
static HMI_VIDEO_SDRAM uint16_t frame_pixels[2][HMI_VIDEO_MAX_WIDTH * HMI_VIDEO_MAX_HEIGHT];
static uint32_t frame_back;
/* Three bytes a pixel: the worst case is 4:4:4, where nothing is subsampled. */
static HMI_VIDEO_SDRAM uint8_t frame_blocks[HMI_VIDEO_MAX_WIDTH * HMI_VIDEO_MAX_HEIGHT * 3U];
static HMI_VIDEO_SDRAM uint8_t frame_compressed[HMI_VIDEO_MAX_FRAME_BYTES];

/**
 * What the last frames cost, for reading off the running board.
 *
 * There is no console on this firmware, so this is how the question "where
 * does the time go" gets answered: pause the debugger and print it —
 *
 *   p hmi_video_stats
 *
 * Microseconds, from the Cortex-M7 cycle counter. `frame_us` is the whole
 * timer callback for the last frame; the three stages inside it should add
 * up to most of it. Anything over the period (41 667 us at 24 fps) is a
 * dropped frame. `frames` counts shown frames since the widget started.
 */
typedef struct {
    uint32_t frames;
    uint32_t read_us;
    uint32_t decode_us;
    uint32_t show_us;
    uint32_t frame_us;
    uint32_t worst_frame_us;
    uint32_t compressed_bytes;
} hmi_video_stats_t;

hmi_video_stats_t hmi_video_stats;

static void cycle_counter_start(void)
{
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

static uint32_t cycles_to_us(uint32_t cycles)
{
    return cycles / (SystemCoreClock / 1000000U);
}

static void video_timer_cb(lv_timer_t *timer);

/* ------------------------------------------------------------------ */
/*  What the widget shows                                              */
/* ------------------------------------------------------------------ */

/**
 * Put a message on the widget, with the reason under it when there is one.
 *
 * The headline is for the person in front of the panel: *Video not found*,
 * *No SD card*. The detail line is for whoever has to fix it, and says which
 * step failed and what it reported — "mount failed (FR 13)", "decode: HAL 3
 * err 0x4". Without it the headline is all there is, and "SD card unreadable"
 * on its own cannot be acted on by anyone.
 */
static void show_message(video_widget_t *widget, const char *text, const char *detail)
{
    char combined[HMI_VIDEO_TEXT_MAX];

    if ((detail != NULL) && (detail[0] != 0) && (text[0] != 0)) {
        (void)lv_snprintf(combined, sizeof(combined), "%s\n%s", text, detail);
    } else {
        (void)lv_snprintf(combined, sizeof(combined), "%s", text);
    }

    if (strcmp(widget->shown, combined) == 0) {
        return;
    }
    (void)lv_strlcpy(widget->shown, combined, sizeof(widget->shown));

    if (widget->message != NULL) {
        lv_label_set_text(widget->message, combined);
        lv_obj_remove_flag(widget->message, LV_OBJ_FLAG_HIDDEN);
    }
    /* The overlay sits above everything LVGL draws, the message included. */
    board_display_overlay_hide();
}

/**
 * Put the decoded frame on screen: centred in the widget's box, at its own
 * size, clipped to the box. Not scaled — the LTDC cannot, and a widget sized
 * to the video is the design to aim for anyway.
 */
static bool show_picture(video_widget_t *widget, const uint16_t *pixels, uint32_t w, uint32_t h)
{
    lv_area_t box;
    board_overlay_t overlay;

    widget->shown[0] = 0;
    if (widget->message != NULL) {
        lv_obj_add_flag(widget->message, LV_OBJ_FLAG_HIDDEN);
    }

    lv_obj_get_coords(widget->frame, &box);
    overlay.pixels = pixels;
    overlay.width = w;
    overlay.height = h;
    overlay.x = box.x1 + ((lv_area_get_width(&box) - (int32_t)w) / 2);
    overlay.y = box.y1 + ((lv_area_get_height(&box) - (int32_t)h) / 2);
    overlay.clip_x1 = box.x1;
    overlay.clip_y1 = box.y1;
    overlay.clip_x2 = box.x2;
    overlay.clip_y2 = box.y2;
    return board_display_overlay_show(&overlay);
}

/** A failure nothing on the panel will change. Stays until the screen is left. */
static void fail(video_widget_t *widget, const char *text, const char *detail)
{
    widget->state = VIDEO_FAILED;
    widget->retry_at = 0U;
    show_message(widget, text, detail);
}

/** A failure that may clear itself. Shown now, tried again in a second. */
static void retry_later(video_widget_t *widget, const char *text, const char *detail)
{
    widget->state = VIDEO_IDLE;
    widget->retry_at = lv_tick_get() + HMI_VIDEO_RETRY_PERIOD_MS;
    if (widget->retry_at == 0U) {
        widget->retry_at = 1U;
    }
    show_message(widget, text, detail);
}

/* ------------------------------------------------------------------ */
/*  The session                                                        */
/* ------------------------------------------------------------------ */

static void close_session(void)
{
    board_display_overlay_hide();
    if (session_owner != NULL) {
        hmi_avi_close(&session);
        if (session_owner->state == VIDEO_PLAYING) {
            session_owner->state = VIDEO_IDLE;
        }
        session_owner->holds_session = false;
        session_owner = NULL;
    }
}

/**
 * Open the file this widget names and take the shared session for it.
 *
 * Every failure ends with a message on the widget's face rather than a return
 * code the caller has to interpret, because there is exactly one thing to do
 * with any of them: say so on the panel. The distinctions the messages keep
 * are the ones that change what the user should go and do — a card that is not
 * in the slot sends them somewhere different from a name that is misspelled.
 */
static bool open_session(video_widget_t *widget)
{
    hmi_avi_result_t opened;

