rojarsmith/edt-hmi-studio/firmware/stm32h747i-disco/src/hmi_video.c
    close_session();

    if (widget->file_name[0] == 0) {
        fail(widget, HMI_VIDEO_MSG_NOT_FOUND, "no file name set");
        return false;
    }

    switch (hmi_sd_mount()) {
    case HMI_SD_NO_CARD:
        retry_later(widget, HMI_VIDEO_MSG_NO_CARD, NULL);
        return false;
    case HMI_SD_UNREADABLE:
        retry_later(widget, HMI_VIDEO_MSG_CARD_UNREADABLE, hmi_sd_detail());
        return false;
    case HMI_SD_READY:
    default:
        break;
    }

    if (!hmi_jpeg_init()) {
        fail(widget, HMI_VIDEO_MSG_FORMAT, hmi_jpeg_detail());
        return false;
    }

    opened = hmi_avi_open(&session, widget->file_name);
    switch (opened) {
    case HMI_AVI_OK:
        break;
    case HMI_AVI_NO_FILE:
        /* Retried, not final: the usual fix is to copy the file onto the card
           and push it back in, and the detect pin will see that happen. */
        retry_later(widget, HMI_VIDEO_MSG_NOT_FOUND, session.detail);
        return false;
    case HMI_AVI_NOT_MJPEG:
        fail(widget, HMI_VIDEO_MSG_FORMAT, session.detail);
        return false;
    case HMI_AVI_UNREADABLE:
    default:
        /* The card mounted a moment ago, so a file that will not parse is the
           file's problem rather than the card's. */
        fail(widget, HMI_VIDEO_MSG_FORMAT, session.detail);
        return false;
    }

    if ((session.width > HMI_VIDEO_MAX_WIDTH) ||
        (session.height > HMI_VIDEO_MAX_HEIGHT)) {
        char detail[48];

        (void)lv_snprintf(
            detail, sizeof(detail), "%lux%lu larger than %ux%u",
            (unsigned long)session.width, (unsigned long)session.height,
            (unsigned)HMI_VIDEO_MAX_WIDTH, (unsigned)HMI_VIDEO_MAX_HEIGHT);
        hmi_avi_close(&session);
        fail(widget, HMI_VIDEO_MSG_FORMAT, detail);
        return false;
    }

    session_owner = widget;
    widget->holds_session = true;
    widget->state = widget->auto_play ? VIDEO_PLAYING : VIDEO_PAUSED;

    if (video_timer != NULL) {
        uint32_t period_ms = session.frame_period_us / 1000U;

        if (period_ms == 0U) {
            period_ms = 1U;
        }
        lv_timer_set_period(video_timer, period_ms);
    }

    /* Paused before the first frame has anything to show, so the widget stays
       on its black frame rather than on a stale picture from another file. */
    if (widget->state == VIDEO_PAUSED) {
        show_message(widget, HMI_VIDEO_MSG_BLANK, NULL);
    }
    return true;
}

/**
 * Read, decode and show one frame.
 *
 * Returns false when playback stopped, for whatever reason — the widget has
 * already been told what to say by then.
 */
static bool advance_frame(video_widget_t *widget)
{
    const uint8_t *compressed = NULL;
    uint32_t compressed_bytes = 0U;
    uint32_t decoded_width = 0U;
    uint32_t decoded_height = 0U;
    hmi_avi_result_t read;
    hmi_jpeg_result_t decoded;
    uint16_t *pixels;
    uint32_t t0;
    uint32_t t1;
    uint32_t t2;
    uint32_t t3;

    t0 = DWT->CYCCNT;
    read = hmi_avi_next_frame(
        &session, frame_compressed, sizeof(frame_compressed), &compressed,
        &compressed_bytes);

    if (read == HMI_AVI_END) {
        if (!widget->loop) {
            /* The last frame stays on screen. Stopping to black would look
               like a failure, and the video did exactly what it was asked. */
            widget->state = VIDEO_ENDED;
            return false;
        }
        hmi_avi_rewind(&session);
        read = hmi_avi_next_frame(
            &session, frame_compressed, sizeof(frame_compressed), &compressed,
            &compressed_bytes);
        if (read == HMI_AVI_END) {
            /* A file whose movi list holds no video chunks at all. Looping it
               would spin this timer forever finding nothing. */
            fail(widget, HMI_VIDEO_MSG_FORMAT, "no video frames in file");
            return false;
        }
    }

    if (read == HMI_AVI_FRAME_TOO_LARGE) {
        fail(widget, HMI_VIDEO_MSG_FORMAT, session.detail);
        return false;
    }
    if (read != HMI_AVI_OK) {
        /* The card stopped answering mid-file — or one read failed its CRC.
           Dropping the mount means the next attempt starts from the card
           again rather than from a volume that is no longer there, and
           retrying is what turns one bad read into a skipped frame rather
           than the end of the film. */
        char detail[48];

        (void)lv_strlcpy(
            detail,
            (hmi_sd_detail()[0] != 0) ? hmi_sd_detail() : session.detail,
            sizeof(detail));
        close_session();
        hmi_sd_unmount();
        retry_later(widget, HMI_VIDEO_MSG_CARD_UNREADABLE, detail);
        return false;
    }

    t1 = DWT->CYCCNT;

    /* Into the buffer the panel is not scanning. The reader has already
       padded the frame to a word boundary, so the HAL's whole-word input
       drops nothing that matters. */
    pixels = frame_pixels[frame_back];
    decoded = hmi_jpeg_decode_to_rgb565(
        compressed,
        (compressed_bytes + 3U) & ~3U,
        frame_blocks,
        sizeof(frame_blocks),
        pixels,
        /* Packed at the frame's own width, so the overlay's pitch cannot
           disagree with what DMA2D actually wrote — the AVI header's idea of
           the size and the JPEG's need not match. */
        0U,
        HMI_VIDEO_MAX_WIDTH,
        HMI_VIDEO_MAX_HEIGHT,
        &decoded_width,
        &decoded_height);

    if (decoded != HMI_JPEG_OK) {
        fail(widget, HMI_VIDEO_MSG_FORMAT, hmi_jpeg_detail());
        return false;
    }
    t2 = DWT->CYCCNT;

    if (!show_picture(widget, pixels, decoded_width, decoded_height)) {
        fail(widget, HMI_VIDEO_MSG_FORMAT, "overlay refused the frame");
        return false;
    }
    frame_back ^= 1U;
    t3 = DWT->CYCCNT;

    hmi_video_stats.frames++;
    hmi_video_stats.compressed_bytes = compressed_bytes;
    hmi_video_stats.read_us = cycles_to_us(t1 - t0);
    hmi_video_stats.decode_us = cycles_to_us(t2 - t1);
    hmi_video_stats.show_us = cycles_to_us(t3 - t2);
    hmi_video_stats.frame_us = cycles_to_us(t3 - t0);
    if (hmi_video_stats.frame_us > hmi_video_stats.worst_frame_us) {
        hmi_video_stats.worst_frame_us = hmi_video_stats.frame_us;
    }
    return true;
}

/**
 * Put every widget that is not on the loaded screen back to its resting state.
 *
 * This is what makes leaving a screen and coming back retry: a widget that
 * failed keeps its message only while it is being looked at, and is opened
 * again from scratch the next time it appears. It is also what releases the
 * card, so a video on the screen being loaded starts from its own first frame
 * rather than waiting for another screen's file to be closed.
 */
static void release_offscreen_widgets(const lv_obj_t *screen)
{
    for (uint32_t index = 0U; index < widget_count; ++index) {
        video_widget_t *widget = &widgets[index];

        if (widget->frame == NULL) {
            continue;
        }
        if (lv_obj_get_screen(widget->frame) == screen) {
            continue;
        }
        if (widget->holds_session) {
            close_session();
        }
        widget->state = VIDEO_IDLE;
        widget->retry_at = 0U;
        widget->shown[0] = 0;
    }
}

/**
 * The widget that should be playing: the first registered one that is on the
 * loaded screen and not hidden.
 *
 * Registration order rather than anything cleverer, because it is the order
 * the widgets appear in the project and therefore the one a user can predict.
 */
static video_widget_t *active_widget(const lv_obj_t *screen)
{
    for (uint32_t index = 0U; index < widget_count; ++index) {
        video_widget_t *widget = &widgets[index];

        if (widget->frame == NULL) {
            continue;
        }
        if (lv_obj_get_screen(widget->frame) != screen) {
            continue;
        }
        if (lv_obj_has_flag(widget->frame, LV_OBJ_FLAG_HIDDEN)) {
            continue;
        }
        return widget;
    }
    return NULL;
}

/** Back to the slow tick, for whenever nothing is decoding. */
static void idle_tick(void)
{
    if (video_timer != NULL) {
        lv_timer_set_period(video_timer, HMI_VIDEO_IDLE_PERIOD_MS);
    }
}

static void video_timer_cb(lv_timer_t *timer)
{
    const lv_obj_t *screen = lv_screen_active();
    video_widget_t *widget;

    (void)timer;

    if (screen == NULL) {
        return;
    }

    release_offscreen_widgets(screen);

