rojarsmith/edt-hmi-studio/firmware/stm32h747i-disco/src/hmi_video.c
    widget = active_widget(screen);
    if (widget == NULL) {
        idle_tick();
        return;
    }

    /* Every other video on this screen says why it is dark, rather than
       sitting as an unexplained black rectangle. There is one codec. */
    for (uint32_t index = 0U; index < widget_count; ++index) {
        video_widget_t *other = &widgets[index];

        if ((other == widget) || (other->frame == NULL)) {
            continue;
        }
        if (lv_obj_get_screen(other->frame) == screen) {
            if (other->holds_session) {
                close_session();
            }
            other->state = VIDEO_IDLE;
            show_message(other, HMI_VIDEO_MSG_BUSY, NULL);
        }
    }

    if (widget->state == VIDEO_FAILED) {
        /* Said its piece. Retrying every frame period would hammer a card that
           is not there; release_offscreen_widgets is what gives it another go,
           when the screen has been left and come back to. */
        idle_tick();
        return;
    }

    if ((widget->retry_at != 0U) && !widget->holds_session) {
        /* A card-class failure, waiting its second out. */
        if ((int32_t)(lv_tick_get() - widget->retry_at) < 0) {
            idle_tick();
            return;
        }
        widget->retry_at = 0U;
    }

    if (!widget->holds_session && !open_session(widget)) {
        idle_tick();
        return;
    }

    if (widget->state != VIDEO_PLAYING) {
        idle_tick();
        return;
    }

    if (!advance_frame(widget)) {
        idle_tick();
    }
}

/* ------------------------------------------------------------------ */
/*  What generated code calls                                          */
/* ------------------------------------------------------------------ */

static video_widget_t *find_widget(const lv_obj_t *frame)
{
    for (uint32_t index = 0U; index < widget_count; ++index) {
        if (widgets[index].frame == frame) {
            return &widgets[index];
        }
    }
    return NULL;
}

/**
 * A widget that goes away takes its registration with it.
 *
 * Screens are rebuilt — a language switch alone is enough — and a stale
 * lv_obj_t pointer here would be dereferenced by the next timer tick.
 */
static void frame_deleted_cb(lv_event_t *event)
{
    video_widget_t *widget = (video_widget_t *)lv_event_get_user_data(event);

    if (widget == NULL) {
        return;
    }
    if (widget->holds_session) {
        close_session();
    }
    widget->frame = NULL;
    widget->message = NULL;
    widget->screen = NULL;
    widget->state = VIDEO_IDLE;
    widget->retry_at = 0U;
}

/**
 * The screen is going: take the overlay down *now*, not at the next tick.
 *
 * The layer sits above LVGL, so a video left up for the 200 ms until the
 * timer notices would be painted over the top of the screen that replaced
 * it. The session goes with it; the widget is reopened from its first frame
 * if the screen comes back.
 */
static void screen_unload_cb(lv_event_t *event)
{
    video_widget_t *widget = (video_widget_t *)lv_event_get_user_data(event);

    if ((widget != NULL) && widget->holds_session) {
        close_session();
    }
    board_display_overlay_hide();
}

void hmi_video_attach(
    lv_obj_t *frame,
    const char *file_name,
    bool auto_play,
    bool loop)
{
    video_widget_t *widget;

    if (frame == NULL) {
        return;
    }

    /* A slot freed by a deleted widget is reused before the array grows, so
       rebuilding a screen many times cannot run the registry out. */
    widget = NULL;
    for (uint32_t index = 0U; index < widget_count; ++index) {
        if (widgets[index].frame == NULL) {
            widget = &widgets[index];
            break;
        }
    }
    if ((widget == NULL) && (widget_count < HMI_VIDEO_MAX_WIDGETS)) {
        widget = &widgets[widget_count];
        widget_count++;
    }
    if (widget == NULL) {
        return;
    }

    memset(widget, 0, sizeof(*widget));
    widget->frame = frame;
    widget->screen = lv_obj_get_screen(frame);
    widget->auto_play = auto_play;
    widget->loop = loop;
    widget->state = VIDEO_IDLE;

    if (file_name != NULL) {
        (void)lv_strlcpy(widget->file_name, file_name, HMI_VIDEO_MAX_NAME);
    }

    cycle_counter_start();

    /* Inherits the widget's text colour, which is the row the property editor
       calls Text Color — so the message is styled with the widget rather than
       hard-coded here. */
    widget->message = lv_label_create(frame);
    /* Wrapped, not dotted: the detail line under a message is the part that
       says what to fix, and it must not be the part that gets cut off. */
    lv_label_set_long_mode(widget->message, LV_LABEL_LONG_MODE_WRAP);
    lv_obj_set_width(widget->message, lv_pct(90));
    lv_obj_set_style_text_align(widget->message, LV_TEXT_ALIGN_CENTER, 0);
    lv_label_set_text(widget->message, "");
    lv_obj_center(widget->message);

    lv_obj_add_event_cb(frame, frame_deleted_cb, LV_EVENT_DELETE, widget);
    if (widget->screen != NULL) {
        lv_obj_add_event_cb(
            widget->screen, screen_unload_cb, LV_EVENT_SCREEN_UNLOAD_START, widget);
    }

    if (video_timer == NULL) {
        video_timer = lv_timer_create(
            video_timer_cb, HMI_VIDEO_IDLE_PERIOD_MS, NULL);
    }
}

void hmi_video_play(lv_obj_t *frame)
{
    video_widget_t *widget = find_widget(frame);

    if ((widget == NULL) || (widget->state == VIDEO_FAILED)) {
        return;
    }
    if (widget->state == VIDEO_ENDED) {
        /* Playing something that has ended starts it again — the only reading
           of "play" that does anything from here. */
        if (widget->holds_session) {
            hmi_avi_rewind(&session);
        }
    }
    widget->state = VIDEO_PLAYING;
    if (widget->holds_session && (video_timer != NULL)) {
        uint32_t period_ms = session.frame_period_us / 1000U;

        lv_timer_set_period(video_timer, (period_ms == 0U) ? 1U : period_ms);
    }
}

void hmi_video_pause(lv_obj_t *frame)
{
    video_widget_t *widget = find_widget(frame);

    if ((widget != NULL) && (widget->state == VIDEO_PLAYING)) {
        widget->state = VIDEO_PAUSED;
    }
}

void hmi_video_stop(lv_obj_t *frame)
{
    video_widget_t *widget = find_widget(frame);

    if ((widget == NULL) || (widget->state == VIDEO_FAILED)) {
        return;
    }
    if (widget->holds_session) {
        hmi_avi_rewind(&session);
    }
    widget->state = VIDEO_PAUSED;
    /* Back to the black frame: a stopped video showing its last frame would be
       indistinguishable from a paused one. */
    show_message(widget, HMI_VIDEO_MSG_BLANK, NULL);
}
